In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.read_csv(r'C:\Users\Pamela\OneDrive\Desktop\SkilHarvest\Assignments\messy_data.xlsx - Sheet1.csv')

In [3]:
data

,TrnsnID,Data,CusmrID,ProdtID,ProdtName,Qutity,Prize,TtlSales,PaymentType,CusterAge
0,7402,03/17/2026,991,1045,Boo E,9,167.72,2935.06,NaN,87
1,5835,26-01-2035,741,1040,Book J,18,193.27,4386.52,debit card,69
2,2123,05/26/2035,933,1062,Bok N,5,126.39,1948.46,Cash,15
3,8789,28-02-2036,641,1060,Book I,6,66.98,1757.26,Cash,22
4,305,19-04-2023,123,1058,Book B,15,33.63,2578.19,Cash,-1
...,...,...,...,...,...,...,...,...,...,...
10095,5735,04/03/2027,52,1066,Book G,1,191.41,2788.25,Credit Card,91
10096,5192,08/16/2025,334,1093,Bok N,-2,186.16,1187.53,paypal,50
10097,5391,06/18/2026,657,1047,Bookk H,5,84.38,2119.76,debit card,63
10098,861,04/08/2034,579,1014,Bok N,19,137.58,1708.87,Debit,-7
10099,7271,26-04-2029,153,1052,Book T,10,159.98,2743.67,debit card,77

# Checking for and removing duplicate values

In [4]:
data.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
10095    False
10096    False
10097    False
10098    False
10099    False
Length: 10100, dtype: bool

In [5]:
data.drop_duplicates(inplace = True)
data

,TrnsnID,Data,CusmrID,ProdtID,ProdtName,Qutity,Prize,TtlSales,PaymentType,CusterAge
0,7402,03/17/2026,991,1045,Boo E,9,167.72,2935.06,NaN,87
1,5835,26-01-2035,741,1040,Book J,18,193.27,4386.52,debit card,69
2,2123,05/26/2035,933,1062,Bok N,5,126.39,1948.46,Cash,15
3,8789,28-02-2036,641,1060,Book I,6,66.98,1757.26,Cash,22
4,305,19-04-2023,123,1058,Book B,15,33.63,2578.19,Cash,-1
...,...,...,...,...,...,...,...,...,...,...
10095,5735,04/03/2027,52,1066,Book G,1,191.41,2788.25,Credit Card,91
10096,5192,08/16/2025,334,1093,Bok N,-2,186.16,1187.53,paypal,50
10097,5391,06/18/2026,657,1047,Bookk H,5,84.38,2119.76,debit card,63
10098,861,04/08/2034,579,1014,Bok N,19,137.58,1708.87,Debit,-7
10099,7271,26-04-2029,153,1052,Book T,10,159.98,2743.67,debit card,77

# Checking for empty spaces in the data

In [6]:
data.isna().sum()

TrnsnID           0
Data              0
CusmrID           0
ProdtID           0
ProdtName       994
Qutity            0
Prize             0
TtlSales          0
PaymentType    1439
CusterAge         0
dtype: int64

In [7]:
data.isnull()

,TrnsnID,Data,CusmrID,ProdtID,ProdtName,Qutity,Prize,TtlSales,PaymentType,CusterAge
0,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...
10095,False,False,False,False,False,False,False,False,False,False
10096,False,False,False,False,False,False,False,False,False,False
10097,False,False,False,False,False,False,False,False,False,False
10098,False,False,False,False,False,False,False,False,False,False
10099,False,False,False,False,False,False,False,False,False,False

# Putting all dates in similar format

In [8]:
#checking the date's data type 
type('Data')

str

In [9]:
data['Data'] = data['Data'].str.replace('-','/')

In [10]:
#check to see how the date column now looks
data['Data']

0        03/17/2026
1        26/01/2035
2        05/26/2035
3        28/02/2036
4        19/04/2023
            ...
10095    04/03/2027
10096    08/16/2025
10097    06/18/2026
10098    04/08/2034
10099    26/04/2029
Name: Data, Length: 10000, dtype: object

In [11]:
#now I want to change the data type to datetime
#data['Data'] = pd.to_datetime(data['Data'])
#data['Data']

In [12]:
data.head()

,TrnsnID,Data,CusmrID,ProdtID,ProdtName,Qutity,Prize,TtlSales,PaymentType,CusterAge
0,7402,03/17/2026,991,1045,Boo E,9,167.72,2935.06,NaN,87
1,5835,26/01/2035,741,1040,Book J,18,193.27,4386.52,debit card,69
2,2123,05/26/2035,933,1062,Bok N,5,126.39,1948.46,Cash,15
3,8789,28/02/2036,641,1060,Book I,6,66.98,1757.26,Cash,22
4,305,19/04/2023,123,1058,Book B,15,33.63,2578.19,Cash,-1

# Starndadising payment names

In [13]:
#total number of times each payment method was used
data['PaymentType'].value_counts()

PaymentType
Debit          1452
Credit         1433
Cash           1426
Credit Card    1419
debit card     1417
paypal         1414
Name: count, dtype: int64

In [14]:
#what are the different payment methods currently showing
data['PaymentType'].unique()

array([nan, 'debit card', 'Cash', 'Debit', 'Credit', 'Credit Card',
       'paypal'], dtype=object)

In [15]:
#making entries consistent
data['PaymentType'] = data['PaymentType'].replace({'nan':'NaN','debit card':'Debit Card','paypal':'Paypal'})
data.head()

,TrnsnID,Data,CusmrID,ProdtID,ProdtName,Qutity,Prize,TtlSales,PaymentType,CusterAge
0,7402,03/17/2026,991,1045,Boo E,9,167.72,2935.06,NaN,87
1,5835,26/01/2035,741,1040,Book J,18,193.27,4386.52,Debit Card,69
2,2123,05/26/2035,933,1062,Bok N,5,126.39,1948.46,Cash,15
3,8789,28/02/2036,641,1060,Book I,6,66.98,1757.26,Cash,22
4,305,19/04/2023,123,1058,Book B,15,33.63,2578.19,Cash,-1

# Negative Values

In [16]:
#finding negative values in the data
data['CusterAge'][data['CusterAge']<0]

4        -1
6        -4
30       -8
32       -1
47      -10
         ..
10065    -5
10068    -4
10075    -7
10080    -1
10098    -7
Name: CusterAge, Length: 974, dtype: int64

In [17]:
#convert the data to string so that we can strp it later
data['CusterAge'] = data['CusterAge'].astype(str)

In [18]:
#using str.strip to remove the negative sign on negative numbers
data['CusterAge'] = data['CusterAge'].str.strip('-')
data['CusterAge']

0        87
1        69
2        15
3        22
4         1
         ..
10095    91
10096    50
10097    63
10098     7
10099    77
Name: CusterAge, Length: 10000, dtype: object

In [19]:
#now I want to convert this data to int in case I want to use it for calculations later
data['CusterAge'] = data['CusterAge'].astype(int)
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10000 entries, 0 to 10099
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   TrnsnID      10000 non-null  int64
 1   Data         10000 non-null  object
 2   CusmrID      10000 non-null  int64
 3   ProdtID      10000 non-null  int64
 4   ProdtName    9006 non-null   object
 5   Qutity       10000 non-null  int64
 6   Prize        10000 non-null  float64
 7   TtlSales     10000 non-null  float64
 8   PaymentType  8561 non-null   object
 9   CusterAge    10000 non-null  int32
dtypes: float64(2), int32(1), int64(4), object(3)
memory usage: 820.3+ KB

In [20]:
#checking if I have taken care of all negative values
Total_Negative_Numbers = data['CusterAge'][data['CusterAge']<0].value_counts().sum()
Total_Negative_Numbers

0

In [21]:
data['CusterAge'].min()

0

In [22]:
data['CusterAge'].max()

99

In [23]:
#it doesn't make sense to have quantity less than 0, so I am checking to make sure it is not like that
data['Qutity'][data['Qutity']<0]

26      -4
35      -4
47      -2
50      -1
51      -3
        ..
10075   -5
10088   -5
10093   -3
10094   -2
10096   -2
Name: Qutity, Length: 1939, dtype: int64

In [24]:
data['Qutity'] = data['Qutity'].astype(str)

In [25]:
data['Qutity'] = data['Qutity'].str.strip('-')
data['Qutity']

0         9
1        18
2         5
3         6
4        15
         ..
10095     1
10096     2
10097     5
10098    19
10099    10
Name: Qutity, Length: 10000, dtype: object

In [26]:
data['Qutity'] = data['Qutity'].astype(int)
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10000 entries, 0 to 10099
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   TrnsnID      10000 non-null  int64
 1   Data         10000 non-null  object
 2   CusmrID      10000 non-null  int64
 3   ProdtID      10000 non-null  int64
 4   ProdtName    9006 non-null   object
 5   Qutity       10000 non-null  int32
 6   Prize        10000 non-null  float64
 7   TtlSales     10000 non-null  float64
 8   PaymentType  8561 non-null   object
 9   CusterAge    10000 non-null  int32
dtypes: float64(2), int32(2), int64(3), object(3)
memory usage: 781.2+ KB

In [27]:
data['Qutity'].min()

0

In [28]:
data['Qutity'].max()

19

In [29]:
#place_holder = np.random.randint(1,2,size=1939), this is because everyone will have bought something

# Unrealistic Values

In [30]:
#cahnge any values that do not make sense in calculations

# Typos and Textual Errors

In [31]:
#list of product names so I can identify the typos
data['ProdtName'].unique()

array(['Boo E', 'Book J', 'Bok N', 'Book I', 'Book B', 'Book D', 'Book P',
       'Book M', 'Book O', 'Book T', 'Book A', nan, 'Book G', 'Book R',
       'Book L', 'Book K', 'Book F', 'Bookk H', 'Book S'], dtype=object)

In [32]:
#correcting the typos
data['ProdtName'] = data['ProdtName'].replace({'Boo E':'Book E','Bok N':'Book N','Bookk H':'Book H'})
data['ProdtName'].unique()

array(['Book E', 'Book J', 'Book N', 'Book I', 'Book B', 'Book D',
       'Book P', 'Book M', 'Book O', 'Book T', 'Book A', nan, 'Book G',
       'Book R', 'Book L', 'Book K', 'Book F', 'Book H', 'Book S'],
      dtype=object)

# Changing datatypes

In [33]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10000 entries, 0 to 10099
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   TrnsnID      10000 non-null  int64
 1   Data         10000 non-null  object
 2   CusmrID      10000 non-null  int64
 3   ProdtID      10000 non-null  int64
 4   ProdtName    9006 non-null   object
 5   Qutity       10000 non-null  int32
 6   Prize        10000 non-null  float64
 7   TtlSales     10000 non-null  float64
 8   PaymentType  8561 non-null   object
 9   CusterAge    10000 non-null  int32
dtypes: float64(2), int32(2), int64(3), object(3)
memory usage: 781.2+ KB

In [34]:
#only columns involved in calculations should be interger data
data['TrnsnID'] = data['TrnsnID'].astype(object)
data['CusmrID'] = data['CusmrID'].astype(object)
data['ProdtID'] = data['ProdtID'].astype(object)
data['CusterAge'] = data['CusterAge'].astype(object)

In [35]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10000 entries, 0 to 10099
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   TrnsnID      10000 non-null  object
 1   Data         10000 non-null  object
 2   CusmrID      10000 non-null  object
 3   ProdtID      10000 non-null  object
 4   ProdtName    9006 non-null   object
 5   Qutity       10000 non-null  int32
 6   Prize        10000 non-null  float64
 7   TtlSales     10000 non-null  float64
 8   PaymentType  8561 non-null   object
 9   CusterAge    10000 non-null  object
dtypes: float64(2), int32(1), object(7)
memory usage: 820.3+ KB

# Correcting spellings in column headers

In [36]:
#Using the rename function to correct the column with wrong spelling
data = data.rename(columns = {'TrnsnID':'TransactionID','Data':'Date','CusmrID':'customerID',
                                    'ProdtID':'ProductID','ProdtName':'ProductName', 'Qutity':'Quantity',
                                    'Prize':'Price','TtlSales':'TotalSales','CusterAge':'CustomerAge'})

In [37]:
data.head()

,TransactionID,Date,customerID,ProductID,ProductName,Quantity,Price,TotalSales,PaymentType,CustomerAge
0,7402,03/17/2026,991,1045,Book E,9,167.72,2935.06,NaN,87
1,5835,26/01/2035,741,1040,Book J,18,193.27,4386.52,Debit Card,69
2,2123,05/26/2035,933,1062,Book N,5,126.39,1948.46,Cash,15
3,8789,28/02/2036,641,1060,Book I,6,66.98,1757.26,Cash,22
4,305,19/04/2023,123,1058,Book B,15,33.63,2578.19,Cash,1